#pragma once
#include <Windows.h>
#ifndef _NTDEF_
typedef _Return_type_success_(return >= 0) LONG NTSTATUS;
typedef NTSTATUS* PNTSTATUS;
#endif

#define NT_SUCCESS(Status) (((NTSTATUS)(Status)) >= 0)
#define STATUS_INFO_LENGTH_MISMATCH ((NTSTATUS)0xC0000004L)
#define STATUS_SUCCESS ((NTSTATUS)0x00000000L)
#define STATUS_UNSUCCESSFUL ((NTSTATUS)0xC0000001)
#define STATUS_INVALID_PAGE_PROTECTION ((NTSTATUS)0xC0000045)
#define STATUS_NOT_FOUND ((NTSTATUS)0xC0000225)
#define NtCurrentProcess() ((HANDLE)(ULONG64) - 1)
#define NtCurrentThread() ((HANDLE)(LONG_PTR) - 2)

#define InitializeObjectAttributes(p, n, a, r, s) \
  {                                               \
    (p)->Length = sizeof(OBJECT_ATTRIBUTES);      \
    (p)->RootDirectory = r;                       \
    (p)->Attributes = a;                          \
    (p)->ObjectName = n;                          \
    (p)->SecurityDescriptor = s;                  \
    (p)->SecurityQualityOfService = NULL;         \
  }

#define OBJ_CASE_INSENSITIVE 0x00000040L

#define FILE_OPEN 0x00000001
#define FILE_OVERWRITE_IF 0x00000005

#define FILE_SYNCHRONOUS_IO_NONALERT 0x00000020
#define FILE_NON_DIRECTORY_FILE 0x00000040

#define RELOC_FLAG(RelInfo) ((RelInfo >> 0x0C) == IMAGE_REL_BASED_DIR64)

typedef struct _PEB_LDR_DATA {
  ULONG Length;                                // 0x00
  BOOLEAN Initialized;                         // 0x04
  PVOID SsHandle;                              // 0x08
  LIST_ENTRY InLoadOrderModuleList;            // 0x0C (x86) / 0x10 (x64)
  LIST_ENTRY InMemoryOrderModuleList;          // 0x14 (x86) / 0x20 (x64)
  LIST_ENTRY InInitializationOrderModuleList;  // 0x1C (x86) / 0x30 (x64)
  VOID* EntryInProgress;                       // 0x40
  BOOLEAN ShutdownInProgress;                  // 0x48
  VOID* ShutdownThreadId;                      // 0x50
} PEB_LDR_DATA, *PPEB_LDR_DATA;

typedef struct _UNICODE_STRING {
  USHORT Length;                                                   // 0x0
  USHORT MaximumLength;                                            // 0x2
  _Field_size_bytes_part_opt_(MaximumLength, Length) PWCH Buffer;  // 0x8
} UNICODE_STRING, *PUNICODE_STRING;

typedef struct _LEAP_SECOND_DATA* PLEAP_SECOND_DATA;

typedef struct _CURDIR {
  UNICODE_STRING DosPath;
  HANDLE Handle;
} CURDIR, *PCURDIR;

typedef struct _STRING {
  USHORT Length;
  USHORT MaximumLength;
  _Field_size_bytes_part_opt_(MaximumLength, Length) PCHAR Buffer;
} STRING, *PSTRING, ANSI_STRING, *PANSI_STRING, OEM_STRING, *POEM_STRING;

typedef struct _RTL_DRIVE_LETTER_CURDIR {
  USHORT Flags;
  USHORT Length;
  ULONG TimeStamp;
  STRING DosPath;
} RTL_DRIVE_LETTER_CURDIR, *PRTL_DRIVE_LETTER_CURDIR;

#define RTL_MAX_DRIVE_LETTERS 32

typedef struct _RTL_USER_PROCESS_PARAMETERS {
  ULONG MaximumLength;
  ULONG Length;

  ULONG Flags;
  ULONG DebugFlags;

  HANDLE ConsoleHandle;
  ULONG ConsoleFlags;
  HANDLE StandardInput;
  HANDLE StandardOutput;
  HANDLE StandardError;

  CURDIR CurrentDirectory;
  UNICODE_STRING DllPath;
  UNICODE_STRING ImagePathName;
  UNICODE_STRING CommandLine;
  PVOID Environment;

  ULONG StartingX;
  ULONG StartingY;
  ULONG CountX;
  ULONG CountY;
  ULONG CountCharsX;
  ULONG CountCharsY;
  ULONG FillAttribute;

  ULONG WindowFlags;
  ULONG ShowWindowFlags;
  UNICODE_STRING WindowTitle;
  UNICODE_STRING DesktopInfo;
  UNICODE_STRING ShellInfo;
  UNICODE_STRING RuntimeData;
  RTL_DRIVE_LETTER_CURDIR CurrentDirectories[RTL_MAX_DRIVE_LETTERS];

  ULONG_PTR EnvironmentSize;
  ULONG_PTR EnvironmentVersion;

  PVOID PackageDependencyData;
  ULONG ProcessGroupId;
  ULONG LoaderThreads;
  UNICODE_STRING RedirectionDllName;  // REDSTONE4
  UNICODE_STRING HeapPartitionName;   // 19H1
  PULONGLONG DefaultThreadpoolCpuSetMasks;
  ULONG DefaultThreadpoolCpuSetMaskCount;
  ULONG DefaultThreadpoolThreadMaximum;
  ULONG HeapMemoryTypeMask;  // WIN11
} RTL_USER_PROCESS_PARAMETERS, *PRTL_USER_PROCESS_PARAMETERS;

typedef struct _PEB {
  BOOLEAN InheritedAddressSpace;     // 0x00 (x86) / 0x00 (x64)
  BOOLEAN ReadImageFileExecOptions;  // 0x01 (x86) / 0x01 (x64)
  BOOLEAN BeingDebugged;             // 0x02 (x86) / 0x02 (x64)
  union {
    BOOLEAN BitField;  // 0x03 (x86) / 0x03 (x64)
    struct {
      BOOLEAN ImageUsesLargePages : 1;
      BOOLEAN IsProtectedProcess : 1;
      BOOLEAN IsImageDynamicallyRelocated : 1;
      BOOLEAN SkipPatchingUser32Forwarders : 1;
      BOOLEAN IsPackagedProcess : 1;
      BOOLEAN IsAppContainer : 1;
      BOOLEAN IsProtectedProcessLight : 1;
      BOOLEAN IsLongPathAwareProcess : 1;
    };
  };
  HANDLE Mutant;                                   // 0x04 (x86) / 0x04 (x64)
  PVOID ImageBaseAddress;                          // 0x08 (x86) / 0x08 (x64)
  PPEB_LDR_DATA Ldr;                               // 0x0C (x86) / 0x18 (x64)
  PRTL_USER_PROCESS_PARAMETERS ProcessParameters;  // 0x10 (x86) / 0x20 (x64)
  PVOID SubSystemData;                             // 0x14 (x86) / 0x28 (x64)
  PVOID ProcessHeap;                               // 0x18 (x86) / 0x30 (x64)
  PRTL_CRITICAL_SECTION FastPebLock;               // 0x1C (x86) / 0x38 (x64)
  PVOID AtlThunkSListPtr;                          // 0x20 (x86) / 0x40 (x64)
  PVOID IFEOKey;                                   // 0x24 (x86) / 0x48 (x64)
} PEB, *PPEB;

typedef struct _CLIENT_ID {
  HANDLE UniqueProcess;
  HANDLE UniqueThread;
} CLIENT_ID, *PCLIENT_ID;

typedef struct _ACTIVATION_CONTEXT {
  LONG RefCount;
  ULONG Flags;
} ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;

typedef struct _GDI_TEB_BATCH {
  ULONG Offset : 31;              // 0x0
  ULONG HasRenderingCommand : 1;  // 0x0
  ULONGLONG HDC;                  // 0x8
  ULONG Buffer[310];              // 0x10
} GDI_TEB_BATCH, *PGDI_TEB_BATCH;

typedef struct _TEB {
  NT_TIB NtTib;                         // Thread Information Block (TIB)
  PVOID EnvironmentPointer;             // Pointer to environment block
  CLIENT_ID ClientId;                   // Thread/Process IDs
  PVOID ActiveRpcHandle;                // Active RPC handle
  PVOID ThreadLocalStoragePointer;      // TLS array
  PPEB ProcessEnvironmentBlock;         // PEB pointer
  ULONG LastErrorValue;                 // Last error value
  ULONG CountOfOwnedCriticalSections;   // Count of critical sections owned
  PVOID CsrClientThread;                // CSR client thread
  PVOID Win32ThreadInfo;                // Win32 thread information (KTHREAD)
  ULONG User32Reserved[26];             // Reserved for User32
  ULONG UserReserved[5];                // Reserved for user
  PVOID WOW32Reserved;                  // WOW32 state
  LCID CurrentLocale;                   // Current locale
  ULONG FpSoftwareStatusRegister;       // Floating-point status
  PVOID SystemReserved1[54];            // Reserved for system
  LONG ExceptionCode;                   // Exception code
  ULONG ActivationContextStackPointer;  // Activation context stack
  ULONG_PTR InstrumentationCallbackSp;  // 0x2d0
  ULONG_PTR InstrumentationCallbackPreviousPc;  // 0x2d8
  ULONG_PTR InstrumentationCallbackPreviousSp;  // 0x2e0
  ULONG TxFsContext;                            // 0x2e8
  BOOLEAN InstrumentationCallbackDisabled;      // 0x2ec
  BOOLEAN UnalignedLoadStoreExceptions;         // 0x2ed
} TEB, *PTEB;

typedef _Function_class_(LDR_INIT_ROUTINE) BOOLEAN NTAPI
    LDR_INIT_ROUTINE(_In_ PVOID DllHandle, _In_ ULONG Reason,
                     _In_opt_ PVOID Context);

typedef LDR_INIT_ROUTINE* PLDR_INIT_ROUTINE;

typedef struct _LDR_DATA_TABLE_ENTRY {
  LIST_ENTRY InLoadOrderLinks;            // 0x0
  LIST_ENTRY InMemoryOrderLinks;          // 0x10
  LIST_ENTRY InInitializationOrderLinks;  // 0x20
  PVOID DllBase;                          // 0x30
  PLDR_INIT_ROUTINE EntryPoint;           // 0x38
  ULONG SizeOfImage;                      // 0x40
  UNICODE_STRING FullDllName;             // 0x48
  UNICODE_STRING BaseDllName;             // 0x58
  union {
    UCHAR FlagGroup[4];  // 0x68
    ULONG Flags;         // 0x68
    struct {
      ULONG PackagedBinary : 1;           // 0x68
      ULONG MarkedForRemoval : 1;         // 0x68
      ULONG ImageDll : 1;                 // 0x68
      ULONG LoadNotificationsSent : 1;    // 0x68
      ULONG TelemetryEntryProcessed : 1;  // 0x68
      ULONG ProcessStaticImport : 1;      // 0x68
      ULONG InLegacyLists : 1;            // 0x68
      ULONG InIndexes : 1;                // 0x68
      ULONG ShimDll : 1;                  // 0x68
      ULONG InExceptionTable : 1;         // 0x68
      ULONG ReservedFlags1 : 2;           // 0x68
      ULONG LoadInProgress : 1;           // 0x68
      ULONG LoadConfigProcessed : 1;      // 0x68
      ULONG EntryProcessed : 1;           // 0x68
      ULONG ProtectDelayLoad : 1;         // 0x68
      ULONG ReservedFlags3 : 2;           // 0x68
      ULONG DontCallForThreads : 1;       // 0x68
      ULONG ProcessAttachCalled : 1;      // 0x68
      ULONG ProcessAttachFailed : 1;      // 0x68
      ULONG CorDeferredValidate : 1;      // 0x68
      ULONG CorImage : 1;                 // 0x68
      ULONG DontRelocate : 1;             // 0x68
      ULONG CorILOnly : 1;                // 0x68
      ULONG ChpeImage : 1;                // 0x68
      ULONG ReservedFlags5 : 2;           // 0x68
      ULONG Redirected : 1;               // 0x68
      ULONG ReservedFlags6 : 2;           // 0x68
      ULONG CompatDatabaseProcessed : 1;  // 0x68
    };
  };
  USHORT ObsoleteLoadCount;                         // 0x6c
  USHORT TlsIndex;                                  // 0x6e
  LIST_ENTRY HashLinks;                             // 0x70
  ULONG TimeDateStamp;                              // 0x80
  PACTIVATION_CONTEXT EntryPointActivationContext;  // 0x88
  PVOID Lock;                                       // 0x90
} LDR_DATA_TABLE_ENTRY, *PLDR_DATA_TABLE_ENTRY;

typedef enum _SYSTEM_INFORMATION_CLASS {
  SystemBasicInformation,                 // q: SYSTEM_BASIC_INFORMATION
  SystemProcessorInformation,             // q: SYSTEM_PROCESSOR_INFORMATION
  SystemPerformanceInformation,           // q: SYSTEM_PERFORMANCE_INFORMATION
  SystemTimeOfDayInformation,             // q: SYSTEM_TIMEOFDAY_INFORMATION
  SystemPathInformation,                  // not implemented
  SystemProcessInformation,               // q: SYSTEM_PROCESS_INFORMATION
  SystemCallCountInformation,             // q: SYSTEM_CALL_COUNT_INFORMATION
  SystemDeviceInformation,                // q: SYSTEM_DEVICE_INFORMATION
  SystemProcessorPerformanceInformation,  // q:
                                          // SYSTEM_PROCESSOR_PERFORMANCE_INFORMATION
                                          // (EX in: USHORT ProcessorGroup)
